## Titanic Data

In [1]:
import pandas as pd
import numpy as np


df_train = pd.read_csv('train.csv')
df_test = pd.read_csv('test.csv')

In [2]:
#encoding cleaning train-test data

sexMap = {'female': 0, 'male': 1}
df_train['Sex'] = df_train['Sex'].map(sexMap)
df_test['Sex'] = df_test['Sex'].map(sexMap)

In [3]:
embarkedMap = {'C': 0, 'Q': 1, 'S': 2}
df_train['Embarked'] = df_train['Embarked'].map(embarkedMap)
df_test['Embarked'] = df_test['Embarked'].map(embarkedMap)

In [4]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0.0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2.0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2.0

In [5]:
col_drop = ['Name', 'Ticket', 'Cabin']

df_train = df_train.drop(columns=col_drop)
df_test = df_test.drop(columns=col_drop)

In [6]:
df_train.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500       2.0
1            2         1       1    0  38.0      1      0  71.2833       0.0
2            3         1       3    0  26.0      0      0   7.9250       2.0
3            4         1       1    0  35.0      1      0  53.1000       2.0
4            5         0       3    1  35.0      0      0   8.0500       2.0

In [7]:
df_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [ ]:
#imputing the fir transform train data and transform test data
from sklearn.impute import SimpleImputer

#creating imputers
imputerMean = SimpleImputer(strategy='mean', missing_values=np.nan)
imputerEmbarked = SimpleImputer(strategy='most_frequent', missing_values=np.nan)
imputerFare = SimpleImputer(strategy='most_frequent', missing_values=np.nan)

In [ ]:
#For checking the missing value in test data
df_test['Fare'].unique()

In [ ]:
#Fit transforming null Age fetures with imputer
df_train['Age'] = imputerMean.fit_transform(df_train[['Age']])
df_test['Age'] = imputerMean.transform(df_test[['Age']])

In [ ]:
df_train['Embarked'] = imputerEmbarked.fit_transform(df_train[['Embarked']])
df_test['Embarked'] = imputerEmbarked.transform(df_test[['Embarked']])

In [23]:
print(df_train.isna().sum())
print(df_test.isna().sum())

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64
PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [24]:
#Only the fare in test data left, there is no empty cells in train data but we will do it regardless.
df_train['Fare'] = imputerFare.fit_transform(df_train[['Fare']])
df_test['Fare'] = imputerFare.transform(df_test[['Fare']])